MySQL
  PS: 一种关联数据库管理系统,关联数据库将数据保存在不同的表中,
    MySQL使用标准的SQL数据语言形式。
    MySQL支持大型数据库,支持5000万条记录的数据仓库,
    32 位系统表文件最大可支持4GB,64 位系统支持最大的表文件为8TB。
    Mysql是可以定制的,采用了GPL协议,你可以修改源码来开发自己的MySql系统。
  'Database'数据库: 按照数据结构来组织、存储和管理数据的仓库,
    每个数据库都有一个或多个不同的API用于创建,访问,管理,搜索和复制所保存的数据。
    使用关系型数据库管理系统'RDBMS'来存储和管理的大数据量。
  'Relational Database Management System'RDBMS,关系数据库管理系统 
    PS: 数据以表格形式出现,每行为各种记录名称,每列为记录名称所对应的数据域
      许多的行和列组成一张表单,若干的表单组成database
    RDBMS 术语
    数据库: 一些关联表的集合 
    数据表: 表是数据的矩阵。在一个数据库中的表看起来像一个简单的电子表格。
    列: 一列(数据元素) 包含了相同的数据, 例如邮政编码的数据。
    行:一行（=元组,或记录）是一组相关的数据,例如一条用户订阅的数据。
    冗余:存储两倍数据,冗余可以使系统速度更快。
    主键:主键是唯一的。一个数据表中只能包含一个主键。你可以使用主键来查询数据。
    外键:外键用于关联两个表。
    复合键:复合键（组合键）将多个列作为一个索引键,一般用于复合索引。
    索引:使用索引可快速访问数据库表中的特定信息。
      索引是对数据库表中一列或多列的值进行排序的一种结构。类似于书籍的目录。
    参照完整性: 参照的完整性要求关系中不允许引用不存在的实体。
      与实体完整性是关系模型必须满足的完整性约束条件,目的是保证数据的一致性。




















