20170915 : 38810 
-------------------------------------------------------------------------------







-------------------------------------------------------------------------todo 
学习计划 
  设计模式 代码的组织
  前端学习总结
    学会归纳 整理 将知识条理清楚的记录下来(而非死记硬背)
    项目驱动 学习分析别人的代码 或自己做一些小项目
  整理笔记&完善知识
  精通jQuery
  完善框架/库 jQuery Bootstrap
  学习新框架 vue Angular React;
  less sass 学习
  个人博客网站
  网站布局 学习
  个人小项目
    整理 fontawesome 图标
  NodeJS
  Python
  C
  ...
  做一个类似炉石传说的卡牌游戏

整理自己的 pub_less.less  
  
myFra

canvas 的压缩质量 具体压缩后的体积 ? 

前端模块化方案  








