PhotoShop 
  界面设置
    新建 设置 初始化
      新建(快捷键Ctrl+N)
      预设:自定义
      宽度:1920(像素)
      高度:2000(像素)
      分辨率:72(像素/英寸)(现在比较常用的)
      背景内容:透明
        PS:可将上述设置设定为 存储预设
        
    设置
      通过新建设置 单位为pixels 背景设置为透明 并储存预设,设为默认的新建样式.
      在 信息 栏选项中更改其显示的单位为像素
      图像-首选项-单位与标尺 设置单位为像素
    
      视图-工作区-新建工作区 保存自己自定义后的界面环境,方便环境的切换.
        
    移动工具设置
      移动工具 快捷键 V
      默认设置为选择的是图层
      
    视图设置
      视图-显示-智能参考线 勾选
      打开 视图-标尺  快捷键:Ctrl+R
      窗口 取消勾选(web切图一般不用的) 库、颜色
        打开  信息、字符
  基本操作
    选区工具 快捷键M
    缩放  Alt+滚轮
    移动  空格+左键
    套索工具  L
  参考线
    隐藏参考线   Ctrl+;
  切片
    根据图层来切片
      将背景切下
        选中该图层-图层菜单-新建基于图层的切片
      只将图案切下(背景为透明)
        选中图层-在右边的图层列表中 右键-编辑图层(若没有则创建智能对象)
        打开新窗口-文件-储存为web所用格式 [快捷键 Ctrl+Shift+S]
  图片周围有光晕
    设置PS中的matte,蒙版或杂边属性,将其设置为和图片相接的背景色.
  快捷键
    标尺————Ctrl+R
    后退一步————Ctrl+Z+Alt
    前进一步————Ctrl+Z+Shift
    根据图层选区————Ctrl+左键在图层栏中选中图层
    取消选区————Ctrl+D(或者使用选区工具)
Zeplin 
  标注与线上协作平台,不同平台的设计师和开发者沟通起来更加轻松便捷
